# FamilyKeepTextReadable Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FamilyKeepTextReadable Property
ParameterTypeId Class See Also
---
"Keep text readable"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FamilyKeepTextReadable { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyKeepTextReadable As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FamilyKeepTextReadable {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace